package lesson2dz;

public class Intervals {
    public static void main(String[] args) {
        //* Для двух интервалов (интервал – это два целых числа [-1, 8]) определить, как они соотносятся: пересекаются, один содержит другой, не пересекаются.
// интервал1 [a1,a2]
        //нтервал2 [b1,b2]

        int a1 = -5;
        int a2 = 15;
        int b1 = -3;
        int b2 = 10;


        if ((a1 <= b1) && (a2 >= b2)) {
            System.out.println("[" + a1 + "," + a2 + "]" + " и " + "[" + b1 + "," + b2 + "]" + " - Один интервал содержит другой");
        } else if ((a1 <= b2) && (a2 >= b1)) {
            System.out.println("Интервалы " + "[" + a1 + "," + a2 + "]" + " и " + "[" + b1 + "," + b2 + "]" + " пересекаются");
        } else if ((a1 > b2) || (a2 < b1)) {
            System.out.println("Интервалы " + "[" + a1 + "," + a2 + "]" + " и " + "[" + b1 + "," + b2 + "]" + " не пересекаются");
        } else {
            System.out.println("Ошибка");
        }

    }
}
